src/Data-Visualization/Interactive Data Visualization for the Web/Interactive-Data-Visualization-for-the-Web.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Interactive Data Visualization for the Web
#+OPTIONS: num:nil H:2


* Preface
On design process:

+ Designing Data Visualizations: Intentional Communication from Data
  to Display by Noah Iliinsky and Julie Steele. O’Reilly Media, 2011.
+ Data Visualization: A Successful Design Process by Andy Kirk. Packt
  Publishing, 2012.
+ The Functional Art: An Introduction to Information Graphics and
  Visualization by Alberto Cairo. New Riders, 2012
+ Information Dashboard Design: The Effective Visual Communication of
  Data by Stephen Few. O’Reilly Media, 2006.

On the practicalities of working with data:
+ Bad Data Handbook: Mapping the World of Data Problems by Q. Ethan
  McCallum. O’Reilly Media, 2012
+ Data Analysis with Open Source Tools: A Hands-On Guide for
  Programmers and Data Scientists by Philipp K. Janert. O’Reilly
  Media, 2010.
+ Python for Data Analysis: Agile Tools for Real World Data by Wes
  McKinney.O’Reilly Media, 2012.
* Introduction
** Why Interactive?
The basic functions of most interactive visualization tools have
changed little since 1996, when Ben Shneiderman of the University of
Maryland first proposed a “Visual Information-Seeking Mantra”:
/overview first, zoom and filter, then details-ondemand/.
* Introducing D3
D3’s official home on the Web is d3js.org.
** What It Doesn’t Do
+ D3 is intended primarily for  explanatoryvisualization work, as
  opposed to exploratory  visualizations.
+ D3 doesn’t even try to support older browsers.
+ D3’s core functionality doesn’t handle bitmap map tiles, such as
  those provided by Google Maps or Cloudmade. D3 is great with
  anything vector—SVG images or GeoJSON data—but wasn’t originally
  intended to work with traditional map tiles.
+ D3 doesn’t hide your original data.
** Origins and Context
Protovis made generating visualizations simple, even for users without
prior programming experience. Yet to achieve this, it created an
abstract representation layer. The designer could address this layer
using Protovis syntax, but it wasn’t accessible through standard
methods, so debugging was difficult.

In 2011, Mike Bostock, Vadim Ogievetsky, and Jeff Heer officially
announced D3, the next evolution in web visualization tools. Unlike
Protovis, D3 operates directly on the web document itself. This means
easier debugging, easier experimentation, and more visual
possibilities. The only downside to this approach is a potentially
steeper learning curve.

** Alternatives

*** Easy Charts
+ DataWrapper: A beautiful web service that lets you upload your data
  and quickly generate a chart that you can republish elsewhere or
  embed on your site. This service was originally intended for
  journalists, but it is helpful for everyone. 
+ Flot; A plotting library for jQuery that uses the HTML canvas
  element and supports older browsers, even all the way back to
  Internet Explorer 6. It supports limited visual forms (lines,
  points, bars, areas), but it is easy to use.
+ Google Chart Tools: Having evolved from their earlier Image Charts
  API, Google’s Chart Tools can be used to generate several standard
  chart types, with support for old versions of IE.
+ gRaphaël: It has more visual flexibility than Flot, and—some might
  say—it is prettier.
+ Highcharts JS: A JavaScript-based charting library with several
  predesigned themes and chart types. It uses SVG for modern browsers
  and falls back on VMLfor old versions of IE, including IE6 and
  later.
+ JavaScript InfoVis Toolkit: The JIT provides several preset
  visualization styles for your data. It includes lots of examples,
  but the documentation is pretty technical. The toolkit is great if
  you like one of the preset styles, but browser support is unclear.
+ jqPlot: A plug-in for charting with jQuery. This supports very
  simple charts and is great if you are okay with the predefined
  styles.
+ jQuery Sparklines: A jQuery plug-in for generating sparklines,
  typically small bar, line, or area charts used inline with text.
+ Peity: A jQuery plug-in for very simple and very  tinybar, line, and
  pie charts that supports only recent browsers.
+ Timeline.js: A library specifically for generating interactive
  timelines. No coding is required; just use the code generator. There
  is not much room for customization, but hey, timelines are really
  hard to do well.
+ YUI Charts: The Charts module for the Y ahoo! User Interface Library
  enables creation of simple charts with a goal of wide browser
  support.

*** Graph Visualizations
+ Arbor.js: A library for graph visualization using jQuery. Even if
  you never use this, you should check out how the documentation is
  presented as a graph, using the tool itself. 
+ Sigma.js: A very lightweight library for graph visualization.
  Sigma.js is beautiful and fast, and it also uses canvas.
*** Geomapping
+ Kartograph: A JavaScript-and-Python combo for gorgeous, entirely
  vector-based mapping by Gregor Aisch with must-see demos. Kartograph
  works with IE7 and newer.
+ Leaflet: A library for tiled maps, designed for smooth interaction
  on both desktop and mobile devices.
+ Modest Maps: The granddaddy of tiled map libraries, Modest Maps has
  been succeeded by Polymaps, but lots of people still love it, as
  it is lightweight and works with old versions of IE and other
  browsers. Modest Maps has been adapted for ActionScript, Processing,
  Python, PHP, Cinder, openFrameworks…yeah, basically everything.
+ Polymaps: A library for displaying tiled maps, with layers of data
  on top of the tiles.
