public_html/Data-Visualization/Interactive Data Visualization for the Web/Interactive-Data-Visualization-for-the-Web.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Interactive Data Visualization for the Web</title>
<!-- 2015-04-22 Wed 21:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Interactive Data Visualization for the Web</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Preface</a></li>
<li><a href="#sec-2">Introduction</a>
<ul>
<li><a href="#sec-2-1">Why Interactive?</a></li>
</ul>
</li>
<li><a href="#sec-3">Introducing D3</a>
<ul>
<li><a href="#sec-3-1">What It Doesn’t Do</a></li>
<li><a href="#sec-3-2">Origins and Context</a></li>
<li><a href="#sec-3-3">Alternatives</a></li>
</ul>
</li>
<li><a href="#sec-4">Technology Fundamentals</a>
<ul>
<li><a href="#sec-4-1">A Note on Compatibility</a></li>
</ul>
</li>
<li><a href="#sec-5">Setup</a>
<ul>
<li><a href="#sec-5-1">Setting Up a Web Server</a></li>
</ul>
</li>
<li><a href="#sec-6">Data</a>
<ul>
<li><a href="#sec-6-1">Binding Data</a></li>
</ul>
</li>
<li><a href="#sec-7">Drawing with Data</a>
<ul>
<li><a href="#sec-7-1">Multivalue Maps</a></li>
</ul>
</li>
<li><a href="#sec-8">Scales</a>
<ul>
<li><a href="#sec-8-1">Setting Up Dynamic Scales</a></li>
<li><a href="#sec-8-2">Incorporating Scaled Values</a></li>
<li><a href="#sec-8-3">Other Methods</a></li>
<li><a href="#sec-8-4">Other Scales</a></li>
</ul>
</li>
<li><a href="#sec-9">Axes</a>
<ul>
<li><a href="#sec-9-1">Setting Up an Axis</a></li>
<li><a href="#sec-9-2">Cleaning It Up</a></li>
<li><a href="#sec-9-3">Check for Ticks</a></li>
<li><a href="#sec-9-4">Formatting Tick Labels</a></li>
</ul>
</li>
<li><a href="#sec-10">Updates, Transitions, and Motion</a>
<ul>
<li><a href="#sec-10-1">Modernizing the Bar Chart</a></li>
</ul>
</li>
<li><a href="#sec-11">cc</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Preface</h2>
<div class="outline-text-2" id="text-1">
<p>
On design process:
</p>

<ul class="org-ul">
<li>Designing Data Visualizations: Intentional Communication from Data
to Display by Noah Iliinsky and Julie Steele. O’Reilly Media, 2011.
</li>
<li>Data Visualization: A Successful Design Process by Andy Kirk. Packt
Publishing, 2012.
</li>
<li>The Functional Art: An Introduction to Information Graphics and
Visualization by Alberto Cairo. New Riders, 2012
</li>
<li>Information Dashboard Design: The Effective Visual Communication of
Data by Stephen Few. O’Reilly Media, 2006.
</li>
</ul>

<p>
On the practicalities of working with data:
</p>
<ul class="org-ul">
<li>Bad Data Handbook: Mapping the World of Data Problems by Q. Ethan
McCallum. O’Reilly Media, 2012
</li>
<li>Data Analysis with Open Source Tools: A Hands-On Guide for
Programmers and Data Scientists by Philipp K. Janert. O’Reilly
Media, 2010.
</li>
<li>Python for Data Analysis: Agile Tools for Real World Data by Wes
McKinney.O’Reilly Media, 2012.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Introduction</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Why Interactive?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The basic functions of most interactive visualization tools have
changed little since 1996, when Ben Shneiderman of the University of
Maryland first proposed a “Visual Information-Seeking Mantra”:
<i>overview first, zoom and filter, then details-ondemand</i>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Introducing D3</h2>
<div class="outline-text-2" id="text-3">
<p>
D3’s official home on the Web is d3js.org.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">What It Doesn’t Do</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>D3 is intended primarily for  explanatoryvisualization work, as
opposed to exploratory  visualizations.
</li>
<li>D3 doesn’t even try to support older browsers.
</li>
<li>D3’s core functionality doesn’t handle bitmap map tiles, such as
those provided by Google Maps or Cloudmade. D3 is great with
anything vector—SVG images or GeoJSON data—but wasn’t originally
intended to work with traditional map tiles.
</li>
<li>D3 doesn’t hide your original data.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Origins and Context</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Protovis made generating visualizations simple, even for users without
prior programming experience. Yet to achieve this, it created an
abstract representation layer. The designer could address this layer
using Protovis syntax, but it wasn’t accessible through standard
methods, so debugging was difficult.
</p>

<p>
In 2011, Mike Bostock, Vadim Ogievetsky, and Jeff Heer officially
announced D3, the next evolution in web visualization tools. Unlike
Protovis, D3 operates directly on the web document itself. This means
easier debugging, easier experimentation, and more visual
possibilities. The only downside to this approach is a potentially
steeper learning curve.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Alternatives</h3>
<div class="outline-text-3" id="text-3-3">
</div><ul class="org-ul"><li><a id="sec-3-3-1" name="sec-3-3-1"></a>Easy Charts<br  /><div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>DataWrapper: A beautiful web service that lets you upload your data
and quickly generate a chart that you can republish elsewhere or
embed on your site. This service was originally intended for
journalists, but it is helpful for everyone. 
</li>
<li>Flot; A plotting library for jQuery that uses the HTML canvas
element and supports older browsers, even all the way back to
Internet Explorer 6. It supports limited visual forms (lines,
points, bars, areas), but it is easy to use.
</li>
<li>Google Chart Tools: Having evolved from their earlier Image Charts
API, Google’s Chart Tools can be used to generate several standard
chart types, with support for old versions of IE.
</li>
<li>gRaphaël: It has more visual flexibility than Flot, and—some might
say—it is prettier.
</li>
<li>Highcharts JS: A JavaScript-based charting library with several
predesigned themes and chart types. It uses SVG for modern browsers
and falls back on VMLfor old versions of IE, including IE6 and
later.
</li>
<li>JavaScript InfoVis Toolkit: The JIT provides several preset
visualization styles for your data. It includes lots of examples,
but the documentation is pretty technical. The toolkit is great if
you like one of the preset styles, but browser support is unclear.
</li>
<li>jqPlot: A plug-in for charting with jQuery. This supports very
simple charts and is great if you are okay with the predefined
styles.
</li>
<li>jQuery Sparklines: A jQuery plug-in for generating sparklines,
typically small bar, line, or area charts used inline with text.
</li>
<li>Peity: A jQuery plug-in for very simple and very  tinybar, line, and
pie charts that supports only recent browsers.
</li>
<li>Timeline.js: A library specifically for generating interactive
timelines. No coding is required; just use the code generator. There
is not much room for customization, but hey, timelines are really
hard to do well.
</li>
<li>YUI Charts: The Charts module for the Y ahoo! User Interface Library
enables creation of simple charts with a goal of wide browser
support.
</li>
</ul>
</div>
</li>

<li><a id="sec-3-3-2" name="sec-3-3-2"></a>Graph Visualizations<br  /><div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>Arbor.js: A library for graph visualization using jQuery. Even if
you never use this, you should check out how the documentation is
presented as a graph, using the tool itself. 
</li>
<li>Sigma.js: A very lightweight library for graph visualization.
Sigma.js is beautiful and fast, and it also uses canvas.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-3" name="sec-3-3-3"></a>Geomapping<br  /><div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li>Kartograph: A JavaScript-and-Python combo for gorgeous, entirely
vector-based mapping by Gregor Aisch with must-see demos. Kartograph
works with IE7 and newer.
</li>
<li>Leaflet: A library for tiled maps, designed for smooth interaction
on both desktop and mobile devices.
</li>
<li>Modest Maps: The granddaddy of tiled map libraries, Modest Maps has
been succeeded by Polymaps, but lots of people still love it, as
it is lightweight and works with old versions of IE and other
browsers. Modest Maps has been adapted for ActionScript, Processing,
Python, PHP, Cinder, openFrameworks…yeah, basically everything.
</li>
<li>Polymaps: A library for displaying tiled maps, with layers of data
on top of the tiles.
</li>
</ul>
</div>
</li>
