src/Data-Visualization/Interactive Data Visualization for the Web/Interactive-Data-Visualization-for-the-Web.org
*** Almost from Scratch
+ Processing.js: A native JavaScript implementation of Processing, the
  fantastic programming language for artists and designers new to
  programming. Processing is written in Java, so exporting Processing
  sketches to the Web traditionally involved clunky Java applets.
  Thanks to Processing.js, regular Processing code can run natively,
  in the browser.
+ Paper.js: A framework for rendering vector graphics to canvas.
+ Raphaël: Another library for drawing vector graphics, popular due to
  its friendly syntax and support for older browsers.
*** Three-Dimensional
+ PhiloGL: A WebGL framework specifically for 3D visualization.
+ Three.js: A library for generating any sort of 3D scene you could
  imagine, produced by Google’s Data Arts team. 
*** Tools Built with D3
+ Crossfilter: A library for working with large, multivariate
  datasets, written primarily by Mike Bostock. This is useful for
  trying to squeeze your “big data” into a relatively small web
  browser.
+ Cubism: A D3 plug-in for visualizing time series data.
+ Dashku: An online tool for data dashboards and widgets updated in
  real time
+ dc.js: The “dc” is short for dimensional charting, as this library
  is optimized for exploring large, multidimensional datasets.
+ NVD3: Reusable charts with D3. NVD3 offers lots of beautiful
  examples, w visual customizations without requiring as much code as
  D3 alone.
+ Polychart.js: More reusable charts, with a range of chart types
  available. Polychart.js is free only for noncommercial use.
+ Rickshaw: A toolkit for displaying time series data that is also
  very customizable.
+ Tributary: A great tool for experimenting with live coding using D3.

* Technology Fundamentals
** A Note on Compatibility
Older browsers don’t support SVG. So, generally speaking, Internet
Explorer version 8 and older will not display SVG images at all. 

That said, it’s polite to notify users of older browsers why the
piece isn’t working. I recommend using *Modernizr* or a similar
JavaScript tool to detect whether or not the browser supports SVG. If
it does, then you can load your D3 code and proceed as normal. If SVG
is  notsupported, then you can display a static, noninteractive
version of your visualization alongside a message explaining that a
current browser is needed. (Be nice and provide links to the Chrome and
Firefox  download pages.)

I’d typically have something like this in the <head>of my document:

#+begin_src javascript
  <script src="js/modernizr.js"></script>
  <script type="text/javascript">
      Modernizr.load({
          test: Modernizr.svg && Modernizr.inlinesvg,
          yep : [ 'js/d3.v3.min.js',
                  'js/script.js' ]
      });
  </script>
#+end_src

caniuse.comis a fantastic resource for supported browser features. See
their list of browsers with SVG support.
* Setup
** Setting Up a Web Server
#+begin_src sh
python -m SimpleHTTPServer 8888 &.
#+end_src

use =http://localhost:8888/.=
* Data
** Binding Data
*** Loading CSV data
#+begin_src javascript
  var dataset;
  d3.csv("food.csv", function(error, data) {
      if (error) {  //If error is not null, something went wrong.
          console.log(error);  //Log the error.
      } else {  //If no error, the file loaded correctly. Yay!
          console.log(data);  //Log the data.
          //Include other code to execute after successful file load here
          dataset = data;
          generateVis();
          hideLoadingMsg();
      }
  });
#+end_src

One more tip: if you have tab-separated data in a TSV file, try the
=d3.tsv()=  method.
*** Loading JSON data
#+begin_src javascript
  d3.json("waterfallVelocities.json", function(json) {
      console.log(json);  //Log output to console
  });
#+end_src
* Drawing with Data
=attr()= sets DOM attribute values, whereas  =style()= applies CSS
styles directly to an element.
** Multivalue Maps

#+begin_src javascript
    svg.select("circle")
        .attr("cx", 0)
        .attr("cy", 0)
        .attr("fill", "red");
    
    svg.select("circle")
        .attr({
            cx: 0,
            cy: 0,
            fill: red
        });
    
  svg.selectAll("rect")
      .data(dataset)
      .enter()
      .append("rect")
      .attr({
          x: function(d, i) { return i * (w / dataset.length); },
          y: function(d) { return h - (d * 4); },
          width: w / dataset.length - barPadding,
          height: function(d) { return d * 4; },
          fill: function(d) { return "rgb(0, 0, " + (d * 10) + ")"; }
      });
#+end_src
* Scales
#+begin_src javascript
  var scale = d3.scale.linear()
      .domain([100, 500])
      .range([10, 350]);
#+end_src

=d3.min() and d3.max()=

#+begin_src javascript
  d3.max(dataset, function(d) {
      return d[0];
  });
#+end_src
** Setting Up Dynamic Scales
#+begin_src javascript
  var xScale = d3.scale.linear()
      .domain([0, d3.max(dataset, function(d) { return d[0]; })])
      .range([0, w]);
#+end_src

** Incorporating Scaled Values
#+begin_src javascript
      .attr("x", function(d) {
      return xScale(d[0]);
      })
      .attr("y", function(d) {
          return yScale(d[1]);
      })
#+end_src
