public_html/Data-Visualization/Interactive Data Visualization for the Web/Interactive-Data-Visualization-for-the-Web.html
<li><a id="sec-3-3-4" name="sec-3-3-4"></a>Almost from Scratch<br  /><div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li>Processing.js: A native JavaScript implementation of Processing, the
fantastic programming language for artists and designers new to
programming. Processing is written in Java, so exporting Processing
sketches to the Web traditionally involved clunky Java applets.
Thanks to Processing.js, regular Processing code can run natively,
in the browser.
</li>
<li>Paper.js: A framework for rendering vector graphics to canvas.
</li>
<li>Raphaël: Another library for drawing vector graphics, popular due to
its friendly syntax and support for older browsers.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-5" name="sec-3-3-5"></a>Three-Dimensional<br  /><div class="outline-text-4" id="text-3-3-5">
<ul class="org-ul">
<li>PhiloGL: A WebGL framework specifically for 3D visualization.
</li>
<li>Three.js: A library for generating any sort of 3D scene you could
imagine, produced by Google’s Data Arts team. 
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-6" name="sec-3-3-6"></a>Tools Built with D3<br  /><div class="outline-text-4" id="text-3-3-6">
<ul class="org-ul">
<li>Crossfilter: A library for working with large, multivariate
datasets, written primarily by Mike Bostock. This is useful for
trying to squeeze your “big data” into a relatively small web
browser.
</li>
<li>Cubism: A D3 plug-in for visualizing time series data.
</li>
<li>Dashku: An online tool for data dashboards and widgets updated in
real time
</li>
<li>dc.js: The “dc” is short for dimensional charting, as this library
is optimized for exploring large, multidimensional datasets.
</li>
<li>NVD3: Reusable charts with D3. NVD3 offers lots of beautiful
examples, w visual customizations without requiring as much code as
D3 alone.
</li>
<li>Polychart.js: More reusable charts, with a range of chart types
available. Polychart.js is free only for noncommercial use.
</li>
<li>Rickshaw: A toolkit for displaying time series data that is also
very customizable.
</li>
<li>Tributary: A great tool for experimenting with live coding using D3.
</li>
</ul>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Technology Fundamentals</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">A Note on Compatibility</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Older browsers don’t support SVG. So, generally speaking, Internet
Explorer version 8 and older will not display SVG images at all. 
</p>

<p>
That said, it’s polite to notify users of older browsers why the
piece isn’t working. I recommend using <b>Modernizr</b> or a similar
JavaScript tool to detect whether or not the browser supports SVG. If
it does, then you can load your D3 code and proceed as normal. If SVG
is  notsupported, then you can display a static, noninteractive
version of your visualization alongside a message explaining that a
current browser is needed. (Be nice and provide links to the Chrome and
Firefox  download pages.)
</p>

<p>
I’d typically have something like this in the &lt;head&gt;of my document:
</p>

<div class="org-src-container">

<pre class="src src-javascript">&lt;script src=<span style="color: #ffa07a;">"js/modernizr.js"</span>&gt;&lt;/script&gt;
&lt;script type=<span style="color: #ffa07a;">"text/javascript"</span>&gt;
    Modernizr.load({
        test: Modernizr.svg &amp;&amp; Modernizr.inlinesvg,
        yep : [ <span style="color: #ffa07a;">'js/d3.v3.min.js'</span>,
                <span style="color: #ffa07a;">'js/script.js'</span> ]
    });
&lt;/script&gt;
</pre>
</div>

<p>
caniuse.comis a fantastic resource for supported browser features. See
their list of browsers with SVG support.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Setup</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Setting Up a Web Server</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-sh">python -m SimpleHTTPServer 8888 &amp;.
</pre>
</div>

<p>
use <code>http://localhost:8888/.</code>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Data</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Binding Data</h3>
<div class="outline-text-3" id="text-6-1">
</div><ul class="org-ul"><li><a id="sec-6-1-1" name="sec-6-1-1"></a>Loading CSV data<br  /><div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">dataset</span>;
d3.csv(<span style="color: #ffa07a;">"food.csv"</span>, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">error</span>, <span style="color: #eedd82;">data</span>) {
    <span style="color: #00ffff;">if</span> (error) {  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">If error is not null, something went wrong.</span>
        console.log(error);  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Log the error.</span>
    } <span style="color: #00ffff;">else</span> {  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">If no error, the file loaded correctly. Yay!</span>
        console.log(data);  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Log the data.</span>
        <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Include other code to execute after successful file load here</span>
        dataset = data;
        generateVis();
        hideLoadingMsg();
    }
});
</pre>
</div>

<p>
One more tip: if you have tab-separated data in a TSV file, try the
<code>d3.tsv()</code>  method.
</p>
</div>
</li>
<li><a id="sec-6-1-2" name="sec-6-1-2"></a>Loading JSON data<br  /><div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">

<pre class="src src-javascript">d3.json(<span style="color: #ffa07a;">"waterfallVelocities.json"</span>, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">json</span>) {
    console.log(json);  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Log output to console</span>
});
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Drawing with Data</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>attr()</code> sets DOM attribute values, whereas  <code>style()</code> applies CSS
styles directly to an element.
</p>
</div>
<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Multivalue Maps</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-javascript">  svg.select(<span style="color: #ffa07a;">"circle"</span>)
      .attr(<span style="color: #ffa07a;">"cx"</span>, 0)
      .attr(<span style="color: #ffa07a;">"cy"</span>, 0)
      .attr(<span style="color: #ffa07a;">"fill"</span>, <span style="color: #ffa07a;">"red"</span>);

  svg.select(<span style="color: #ffa07a;">"circle"</span>)
      .attr({
          cx: 0,
          cy: 0,
          fill: red
      });

svg.selectAll(<span style="color: #ffa07a;">"rect"</span>)
    .data(dataset)
    .enter()
    .append(<span style="color: #ffa07a;">"rect"</span>)
    .attr({
        <span style="color: #87cefa;">x</span>: <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>, <span style="color: #eedd82;">i</span>) { <span style="color: #00ffff;">return</span> i * (w / dataset.length); },
        <span style="color: #87cefa;">y</span>: <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) { <span style="color: #00ffff;">return</span> h - (d * 4); },
        width: w / dataset.length - barPadding,
        <span style="color: #87cefa;">height</span>: <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) { <span style="color: #00ffff;">return</span> d * 4; },
        <span style="color: #87cefa;">fill</span>: <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) { <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"rgb(0, 0, "</span> + (d * 10) + <span style="color: #ffa07a;">")"</span>; }
    });
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Scales</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">scale</span> = d3.scale.linear()
    .domain([100, 500])
    .range([10, 350]);
</pre>
</div>

<p>
<code>d3.min() and d3.max()</code>
</p>

<div class="org-src-container">

<pre class="src src-javascript">d3.max(dataset, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) {
    <span style="color: #00ffff;">return</span> d[0];
});
</pre>
</div>
</div>
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Setting Up Dynamic Scales</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">xScale</span> = d3.scale.linear()
    .domain([0, d3.max(dataset, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) { <span style="color: #00ffff;">return</span> d[0]; })])
    .range([0, w]);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">Incorporating Scaled Values</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-javascript">.attr(<span style="color: #ffa07a;">"x"</span>, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) {
<span style="color: #00ffff;">return</span> xScale(d[0]);
})
.attr(<span style="color: #ffa07a;">"y"</span>, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) {
    <span style="color: #00ffff;">return</span> yScale(d[1]);
})
</pre>
</div>
</div>
</div>
