src/Data-Visualization/Interactive Data Visualization for the Web/Interactive-Data-Visualization-for-the-Web.org
** Other Methods
+ nice()
+ rangeRound()
+ clamp(): Calling clamp(true)on a scale, however, forces all output
  values to be within the specified range. This means excessive values
  will be rounded to the range’s low or high value (whichever is
  nearest).
** Other Scales
+ sqrt
+ pow
+ log
+ quantize
+ quantile
+ ordinal
+ d3.scale.category10(), d3.scale.category20(),
  d3.scale.category20b(), and d3.scale.category20c()
+ d3.time.scale()
* Axes
** Setting Up an Axis
#+begin_src javascript
    var xScale = d3.scale.linear()
        .domain([0, d3.max(dataset, function(d) { return d[0]; })])
        .range([padding, w - padding * 2]);
    //Create SVG element
  var svg = d3.select("body")
      .append("svg")
      .attr("width", w)
      .attr("height", h);

  svg.append("g")
      .call(xAxis);
#+end_src
** Cleaning It Up

#+begin_src javascript
    <style type="text/css">
        .axis path,
        .axis line {
            fill: none;
            stroke: black;
            shape-rendering: crispEdges;
        }
                            
        .axis text {
            font-family: sans-serif;
            font-size: 11px;
        }
    </style>
  <script type="text/javascript">
  //Create scale functions
      var xScale = d3.scale.linear()
      .domain([0, d3.max(dataset, function(d) { return d[0]; })])
      .range([padding, w - padding * 2]);
  //Create SVG element
  var svg = d3.select("body")
      .append("svg")
      .attr("width", w)
      .attr("height", h);
  //Create X axis
  svg.append("g")
      .attr("class", "axis")
      .attr("transform", "translate(0," + (h - padding) + ")")
      .call(xAxis);
  </script>
#+end_src

review your  property namesvery closely to ensure you’re using SVG
names, not CSS ones. (You can reference the complete SVG attribute
list on the MDN site.)
** Check for Ticks
#+begin_src javascript
  var xAxis = d3.svg.axis()
      .scale(xScale)
      .orient("bottom")
      .ticks(5);  //Set rough # of tick
#+end_src

D3 inteprets the =ticks()= value as merely a suggestion and will override
your suggestion with what it determines to be the most clean and
human-readable values
** Formatting Tick Labels
#+begin_src javascript
var formatAsPercentage = d3.format(".1%");
xAxis.tickFormat(formatAsPercentage);
#+end_src
* Updates, Transitions, and Motion
** Modernizing the Bar Chart





* cc

#+begin_src javascript

#+end_src

