public_html/Data-Visualization/Interactive Data Visualization for the Web/Interactive-Data-Visualization-for-the-Web.html
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3">Other Methods</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>nice()
</li>
<li>rangeRound()
</li>
<li>clamp(): Calling clamp(true)on a scale, however, forces all output
values to be within the specified range. This means excessive values
will be rounded to the range’s low or high value (whichever is
nearest).
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4">Other Scales</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>sqrt
</li>
<li>pow
</li>
<li>log
</li>
<li>quantize
</li>
<li>quantile
</li>
<li>ordinal
</li>
<li>d3.scale.category10(), d3.scale.category20(),
d3.scale.category20b(), and d3.scale.category20c()
</li>
<li>d3.time.scale()
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Axes</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Setting Up an Axis</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-javascript">  <span style="color: #00ffff;">var</span> <span style="color: #eedd82;">xScale</span> = d3.scale.linear()
      .domain([0, d3.max(dataset, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) { <span style="color: #00ffff;">return</span> d[0]; })])
      .range([padding, w - padding * 2]);
  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Create SVG element</span>
<span style="color: #00ffff;">var</span> <span style="color: #eedd82;">svg</span> = d3.select(<span style="color: #ffa07a;">"body"</span>)
    .append(<span style="color: #ffa07a;">"svg"</span>)
    .attr(<span style="color: #ffa07a;">"width"</span>, w)
    .attr(<span style="color: #ffa07a;">"height"</span>, h);

svg.append(<span style="color: #ffa07a;">"g"</span>)
    .call(xAxis);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">Cleaning It Up</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">

<pre class="src src-javascript">  &lt;style type=<span style="color: #ffa07a;">"text/css"</span>&gt;
      .axis path,
      .axis line {
          fill: none;
          stroke: black;
          shape-rendering: crispEdges;
      }

      .axis text {
          font-family: sans-serif;
          font-size: 11px;
      }
  &lt;/style&gt;
&lt;script type=<span style="color: #ffa07a;">"text/javascript"</span>&gt;
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Create scale functions</span>
    <span style="color: #00ffff;">var</span> <span style="color: #eedd82;">xScale</span> = d3.scale.linear()
    .domain([0, d3.max(dataset, <span style="color: #00ffff;">function</span>(<span style="color: #eedd82;">d</span>) { <span style="color: #00ffff;">return</span> d[0]; })])
    .range([padding, w - padding * 2]);
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Create SVG element</span>
<span style="color: #00ffff;">var</span> <span style="color: #eedd82;">svg</span> = d3.select(<span style="color: #ffa07a;">"body"</span>)
    .append(<span style="color: #ffa07a;">"svg"</span>)
    .attr(<span style="color: #ffa07a;">"width"</span>, w)
    .attr(<span style="color: #ffa07a;">"height"</span>, h);
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Create X axis</span>
svg.append(<span style="color: #ffa07a;">"g"</span>)
    .attr(<span style="color: #ffa07a;">"class"</span>, <span style="color: #ffa07a;">"axis"</span>)
    .attr(<span style="color: #ffa07a;">"transform"</span>, <span style="color: #ffa07a;">"translate(0,"</span> + (h - padding) + <span style="color: #ffa07a;">")"</span>)
    .call(xAxis);
&lt;/script&gt;
</pre>
</div>

<p>
review your  property namesvery closely to ensure you’re using SVG
names, not CSS ones. (You can reference the complete SVG attribute
list on the MDN site.)
</p>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3">Check for Ticks</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">xAxis</span> = d3.svg.axis()
    .scale(xScale)
    .orient(<span style="color: #ffa07a;">"bottom"</span>)
    .ticks(5);  <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">Set rough # of tick</span>
</pre>
</div>

<p>
D3 inteprets the <code>ticks()</code> value as merely a suggestion and will override
your suggestion with what it determines to be the most clean and
human-readable values
</p>
</div>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4">Formatting Tick Labels</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">formatAsPercentage</span> = d3.format(<span style="color: #ffa07a;">".1%"</span>);
xAxis.tickFormat(formatAsPercentage);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Updates, Transitions, and Motion</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">Modernizing the Bar Chart</h3>
</div>
</div>





<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">cc</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-javascript"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-04-22 Wed 21:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
